
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	СтрокаТабЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	Дата = Объект.Дата;
	Номенклатура = СтрокаТабЧасти.Номенклатура;
	
	СтрокаТабЧасти.Цена = РаботаСоСправочниками.ПрайсЦена(Дата, Номенклатура);
	
	РаботаСДокументами.РассчетСуммы(СтрокаТабЧасти);
	РассчитатьСуммуДокумента();
	
	Элементы.ПереченьНоменклатуры.Обновить();
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуДокумента()
	СуммаДокумента = 0;
	
	Для каждого Строка Из Объект.ПереченьНоменклатуры Цикл
		СуммаДокумента = СуммаДокумента + Строка.Сумма;
	КонецЦикла;
	Объект.СуммаДокумента = СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуНаКлиенте() 
	РассчитатьСуммуДокумента();  
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыСтоимостьПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	РассчитатьСуммуДокумента();
КонецПроцедуры
