
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиИзделий Расход
	Движения.ОстаткиИзделий.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		Движение = Движения.ОстаткиИзделий.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Изделия = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
	КонецЦикла;
	
	// регистр бухгалтерии Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		
		ВидНоменклатуры = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Если ВидНоменклатуры.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Изделия  тогда
			//Дт62 - Кт90
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
			Движение.СчетКт = ПланыСчетов.Основной.Капитал;
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаПереченьНоменклатуры.Сумма;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконта.Клиенты] = Клиент;
			
		Иначе	
			//Дт90 - КТ41
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.Капитал;
			Движение.СчетКт = ПланыСчетов.Основной.Товары;
			Движение.Период = Дата;
			
			Стоимость = ТекСтрокаПереченьНоменклатуры.Количество * ТекСтрокаПереченьНоменклатуры.Цена;
			Движение.Сумма = Стоимость;
			Движение.КоличествоКт = ТекСтрокаПереченьНоменклатуры.Количество;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконта.Изделие] = ВидНоменклатуры;
		КонецЕсли

	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
