
&НаКлиенте
Процедура ДокПродажиПриИзменении(Элемент)
    ВызватьНаСервере();
	ЗаполнитьТабличнуюЧастьПоПродажномуДокументу();
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

&НаСервере
Процедура ВызватьНаСервере()
	Если Объект.ДокПродажи <> Неопределено Тогда
		Объект.Клиент = Объект.ДокПродажи.ПолучитьОбъект().Клиент;
		Объект.Склад = Объект.ДокПродажи.ПолучитьОбъект().Склад;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьПоПродажномуДокументу()

	Если Объект.ДокПродажи = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Продажа = Объект.ДокПродажи.ПолучитьОбъект();
	Объект.НоменклатураВозврата.Очистить();

	Для Каждого СтрокаПродажи Из Продажа.ПереченьНоменклатуры Цикл
		НоваяСтрока = Объект.НоменклатураВозврата.Добавить();
		НоваяСтрока.Номенклатура = СтрокаПродажи.Номенклатура;
		НоваяСтрока.Количество = СтрокаПродажи.Количество;
		НоваяСтрока.Цена = СтрокаПродажи.Цена;
		НоваяСтрока.Сумма = СтрокаПродажи.Сумма;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураВозвратаКоличествоПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.НоменклатураВозврата.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратаСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.НоменклатураВозврата.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВозвратаЦенаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.НоменклатураВозврата.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	Элементы.НоменклатураВозврата.Обновить();
КонецПроцедуры

