
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиИзделий Приход
	Движения.ОстаткиИзделий.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатураВозврата Из НоменклатураВозврата Цикл
		Движение = Движения.ОстаткиИзделий.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Изделия = ТекСтрокаНоменклатураВозврата.Номенклатура;
		Движение.Количество = ТекСтрокаНоменклатураВозврата.Количество;
		Движение.Склад = Склад;
		Движение.Примечание = "# Возврат";
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
