
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудники;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаНачисления.Начислено;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.Начисления.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачислениеЗПНачисления.Сотрудники КАК Сотрудники
	               |ИЗ
	               |	Документ.НачислениеЗП.Начисления КАК НачислениеЗПНачисления
	               |ГДЕ
	               |	НачислениеЗПНачисления.Ссылка = &ТекущийДокумент";
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();
	Сотрудники = РезультатЗапрос.ВыгрузитьКолонку("Сотрудники");
	
	//вызов процедуры из общего модуля
	ПроведенияРасчета.РасчетНачисления(Движения.Начисления,ПланыВидовРасчета.ОсновныеНачисления.Оклад, Сотрудники);
	Движения.Начисления.Записать(,Истина);
	
	ПроведенияРасчета.РасчетНачисления(Движения.Начисления,ПланыВидовРасчета.ОсновныеНачисления.Премия, Сотрудники);
	Движения.Начисления.Записать(,Истина);

КонецПроцедуры
