
&НаКлиенте
Процедура ПоступлениеМатериаловВесПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	СтрокаТаб.Сумма = СтрокаТаб.Вес * СтрокаТаб.Цена;
	
	//РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеМатериаловЦенаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	СтрокаТаб.Сумма = СтрокаТаб.Вес * СтрокаТаб.Цена;
	
	//РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеМатериаловСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	СтрокаТаб.Сумма = СтрокаТаб.Вес * СтрокаТаб.Цена;
	
	//РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеМатериаловНДСПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	 
	 БезНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	 НДС0 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	 НДС10 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	 НДС20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	 	
	Если СтрокаТаб.НДС = БезНДС Или СтрокаТаб.НДС = НДС0 Тогда
			СтрокаТаб.СуммасНДС = 0;
		Иначе
			СтавкаСтрокой = Строка(СтрокаТаб.НДС);
			СтавкаЧислом = Число(СтрЗаменить(СтавкаСтрокой, "%", ""));
			
			СтрокаТаб.СуммасНДС = (СтрокаТаб.Количество * СтрокаТаб.Цена) * (СтавкаЧислом / 100);
		КонецЕсли;
КонецПроцедуры
