
&НаКлиенте
Процедура ИзделияКоличествоПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.Изделия.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб); 
КонецПроцедуры

&НаКлиенте
Процедура ИзделияЦенаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.Изделия.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб); 
КонецПроцедуры

&НаКлиенте
Процедура ИзделияСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.Изделия.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ИзделияНДСПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.Изделия.ТекущиеДанные;
	 
	 БезНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	 НДС0 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	 НДС10 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	 НДС20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	 	
	Если СтрокаТаб.НДС = БезНДС Или СтрокаТаб.НДС = НДС0 Тогда
			СтрокаТаб.СуммасНДС = 0;
		Иначе
			СтавкаСтрокой = Строка(СтрокаТаб.НДС);
			СтавкаЧислом = Число(СтрЗаменить(СтавкаСтрокой, "%", ""));
			
			СтрокаТаб.СуммасНДС = (СтрокаТаб.Количество * СтрокаТаб.Цена) * (СтавкаЧислом / 100);
		КонецЕсли;

КонецПроцедуры
