
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиИзделий Приход
	Движения.ОстаткиИзделий.Записывать = Истина;
	Для Каждого ТекСтрокаИзделия Из Изделия Цикл
		Движение = Движения.ОстаткиИзделий.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Изделия = ТекСтрокаИзделия.Изделие;
		Движение.Количество = ТекСтрокаИзделия.Количество;
	КонецЦикла;
	
	// регистр Бухгалтерия
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаИзделия Из Изделия Цикл
		Движение = Движения.Управленческий.Добавить();
		                  
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.Товары;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.Сумма = ТекСтрокаИзделия.Сумма;
		Движение.КоличествоДт = ТекСтрокаИзделия.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконта.Изделие] = ТекСтрокаИзделия.Изделие; 
		
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
