
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаПоступлениеМатериалов Из ПоступлениеМатериалов Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Материал = ТекСтрокаПоступлениеМатериалов.Материал;
		Движение.Вес = ТекСтрокаПоступлениеМатериалов.Вес;
	КонецЦикла;
	
	// регистр Бухгалтерия
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаПоступлениеМатериалов Из ПоступлениеМатериалов Цикл
		Движение = Движения.Управленческий.Добавить();
		                  
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.Товары;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.Сумма = ТекСтрокаПоступлениеМатериалов.Сумма;
		Движение.КоличествоДт = ТекСтрокаПоступлениеМатериалов.Вес;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконта.Изделие] = ТекСтрокаПоступлениеМатериалов.Материал; 
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
